# ViewId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera..::..ViewId Property
HomeCamera Class See Also
---
The id of the view which is associated to this document's Home view orientation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ElementId ViewId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ViewId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ViewId {
	ElementId^ get ();
}
```

# Remarks
A view can be associated to the document's Home view orientation by the View Cube menu option "Set Current View as Home". Only one view is associated to the Home view orientation at any given time in the document.
# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace